mcci-catena/bootloader/soc/stm32l0/i/mcci_bootloader_stm32l0xx.h
/*

Module:	mcci_bootloader_stm32l0xx.h

Function:
	Register definitions for STM32L0xx CPUs

Copyright and License:
	This file copyright (C) 2021 by

		MCCI Corporation
		3520 Krums Corners Road
		Ithaca, NY  14850

	See accompanying LICENSE file for copyright and license information.

Author:
	Terry Moore, MCCI Corporation	March 2021

*/

#ifndef _mcci_bootloader_stm32l0xx_h_
#define _mcci_bootloader_stm32l0xx_h_	/* prevent multiple includes */

#pragma once

#ifndef _mcci_bootloader_bits_h_
# include "mcci_bootloader_bits.h"
#endif

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/****************************************************************************\
|
|	Register addresses
|
\****************************************************************************/

#define	MCCI_STM32L0_MEMORY_FLASH	UINT32_C(0x08000000)	///< Flash program memory (up to 192K)
#define	MCCI_STM32L0_MEMORY_EEPROM	UINT32_C(0x08080000)	///< Data EEPROM (up to 6K)
#define	MCCI_STM32L0_MEMORY_SYSTEM	UINT32_C(0x1FF00000)	///< System memory (8K)
#define	MCCI_STM32L0_OPTIONS_USER	UINT32_C(0x1FF80000)	///< User option bytes (32)
#define	MCCI_STM32L0_OPTIONS_FACTORY	UINT32_C(0x1FF80020)	///< Factory option bytes (96)
#define	MCCI_STM32L0_MEMORY_SRAM	UINT32_C(0x20000000)	///< SRAM (up to 20K)
#define	MCCI_STM32L0_REG_TIMER2		UINT32_C(0x40000000)	///< Section 20.5: TIMx register map (1K)
#define	MCCI_STM32L0_REG_TIMER3		UINT32_C(0x40000400)	///< Section 20.5: TIMx register map (1K)
#define	MCCI_STM32L0_REG_TIMER6		UINT32_C(0x40001000)	///< Section 22.4.9: TIM6/7 register map (1K)
#define	MCCI_STM32L0_REG_TIMER7		UINT32_C(0x40001400)	///< Section 22.4.9: TIM6/7 register map (1K)
#define	MCCI_STM32L0_REG_RTC		UINT32_C(0x40002800)	///< Section 26.7.21: RTC + BKUP register map (1K)
#define	MCCI_STM32L0_REG_WWDG		UINT32_C(0x40002C00)	///< Section 25.4.4: WWDG register map (1K)
#define	MCCI_STM32L0_REG_IWDG		UINT32_C(0x40003000)	///< Section 24.4.6: IWDG register map (1K)
#define	MCCI_STM32L0_REG_SPI2		UINT32_C(0x40003800)	///< Section 30.7.10: SPI register map (1K)
#define	MCCI_STM32L0_REG_USART2		UINT32_C(0x40004400)	///< Section 28.8.12: USART register map (1K)
#define	MCCI_STM32L0_REG_LPUART1	UINT32_C(0x40004800)	///< Section 29.7.10: LPUART register map (1K)
#define	MCCI_STM32L0_REG_USART4		UINT32_C(0x40004C00)	///< Section 28.8.12: USART register map (1K)
#define	MCCI_STM32L0_REG_USART5		UINT32_C(0x40005000)	///< Section 28.8.12: USART register map (1K)
#define	MCCI_STM32L0_REG_I2C1		UINT32_C(0x40005400)	///< Section 27.7.12: I2C register map (1K)
#define	MCCI_STM32L0_REG_I2C2		UINT32_C(0x40005800)	///< Section 27.7.12: I2C register map (1K)
#define	MCCI_STM32L0_REG_USB_FS		UINT32_C(0x40005C00)	///< Section 31.6.3: USB register map (1K)
#define	MCCI_STM32L0_REG_USB_SRAM	UINT32_C(0x40006000)	///< USB (SRAM 512x16bit) (2K)
#define	MCCI_STM32L0_REG_CRS		UINT32_C(0x40006C00)	///< Section 8.6.5: CRS register map (1K)
#define	MCCI_STM32L0_REG_PWR		UINT32_C(0x40007000)	///< Section 6.4.3: PWR register map (1K)
#define	MCCI_STM32L0_REG_DAC1		UINT32_C(0x40007400)	///< Section 15.10.15: DAC register map (1K)
#define	MCCI_STM32L0_REG_I2C3		UINT32_C(0x40007800)	///< Section 27.7.12: I2C register map (1K)
#define	MCCI_STM32L0_REG_LPTIM1		UINT32_C(0x40007C00)	///< Section 23.6.9: LPTIM register map (1K)
#define	MCCI_STM32L0_REG_SYSCFG_COMP	UINT32_C(0x40010000)	///< Section 10.2.8: SYSCFG register map, Section 16.5.3: COMP register map (1K)
#define	MCCI_STM32L0_REG_EXTI		UINT32_C(0x40010400)	///< Section 13.5.7: EXTI register map (1K)
#define	MCCI_STM32L0_REG_TIM21		UINT32_C(0x40010800)	///< Section 21.4.16: TIM21/22 register map (1K)
#define	MCCI_STM32L0_REG_TIM22		UINT32_C(0x40011400)	///< Section 21.4.16: TIM21/22 register map (1K)
#define	MCCI_STM32L0_REG_FIREWALL	UINT32_C(0x40011C00)	///< Section 5.4.8: Firewall register map (1K)
#define	MCCI_STM32L0_REG_ADC1		UINT32_C(0x40012400)	///< Section 14.12.12: ADC register map (1K)
#define	MCCI_STM32L0_REG_SPI1		UINT32_C(0x40013000)	///< Section 30.7.10: SPI register map (1K)
#define	MCCI_STM32L0_REG_USART1		UINT32_C(0x40013800)	///< Section 28.8.12: USART register map (1K)
#define	MCCI_STM32L0_REG_DBG		UINT32_C(0x40015800)	///< Section 32.10: DBG register map (1K)
#define	MCCI_STM32L0_REG_DMA1		UINT32_C(0x40020000)	///< Section 11.4.8: DMA register map (1K)
#define	MCCI_STM32L0_REG_RCC		UINT32_C(0x40021000)	///< Section 7.3.22: RCC register map (1K)
#define	MCCI_STM32L0_REG_FLASH		UINT32_C(0x40022000)	///< Section 3.7.11: Flash register map (1K)
#define	MCCI_STM32L0_REG_CRC		UINT32_C(0x40023000)	///< Section 4.4.6: CRC register map (1K)
#define	MCCI_STM32L0_REG_TSC		UINT32_C(0x40024000)	///< Section 17.6.11: TSC register map (1K)
#define	MCCI_STM32L0_REG_RNG		UINT32_C(0x40025000)	///< Section 19.8.4: RNG register map (1K)
#define	MCCI_STM32L0_REG_AES		UINT32_C(0x40026000)	///< Section 18.12.13: AES register map (1K)
#define	MCCI_STM32L0_REG_GPIOA		UINT32_C(0x50000000)	///< Section 9.4.12: GPIO register map (1K)
#define	MCCI_STM32L0_REG_GPIOB		UINT32_C(0x50000400)	///< Section 9.4.12: GPIO register map (1K)
#define	MCCI_STM32L0_REG_GPIOC		UINT32_C(0x50000800)	///< Section 9.4.12: GPIO register map (1K)
#define	MCCI_STM32L0_REG_GPIOD		UINT32_C(0x50000C00)	///< Section 9.4.12: GPIO register map (1K)
#define	MCCI_STM32L0_REG_GPIOE		UINT32_C(0x50001000)	///< Section 9.4.12: GPIO register map (1K)
#define	MCCI_STM32L0_REG_GPIOH		UINT32_C(0x50001C00)	///< Section 9.4.12: GPIO register map (1K)

/****************************************************************************\
|
|	Power Control Registers
|
\****************************************************************************/

/// \name PWR registers
///	@{
#define	MCCI_STM32L0_REG_PWR_CR		(MCCI_STM32L0_REG_PWR + 0x0)
#define	MCCI_STM32L0_REG_PWR_CSR	(MCCI_STM32L0_REG_PWR + 0x4)
///	@}

/// \name PWR_CR bits
///	@{
#define	MCCI_STM32L0_REG_PWR_CR_LPRUN		(UINT32_C(1) << 14)	///< Low power run mode
#define	MCCI_STM32L0_REG_PWR_CR_DS_EE_KOFF	(UINT32_C(1) << 13)	///< deep sleep mode with nv mem off

#define	MCCI_STM32L0_REG_PWR_CR_VOS		(UINT32_C(3) << 11)	///< voltage scaling range
# define MCCI_STM32L0_REG_PWR_CR_VOS_NC		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 0)	///< no change / not allowed
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 1)	///< 1.8V
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V5	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 2)	///< 1.5V
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 3)	///< 1.2V

#define	MCCI_STM32L0_REG_PWR_CR_FWU		(UINT32_C(1) << 10)	///< fast wakeup
#define	MCCI_STM32L0_REG_PWR_CR_ULP		(UINT32_C(1) << 9)	///< ultra low-power mode
#define	MCCI_STM32L0_REG_PWR_CR_DBP		(UINT32_C(1) << 8)	///< disable backup write protection

