mcci-catena/bootloader/soc/stm32l0/i/mcci_bootloader_stm32l0xx.h
/// \name RCC_CRRCR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CRRCR_RSV16	UINT32_C(0xFFFF0000)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48CAL	(UINT32_C(0xFF) << 8)	//< calibration for HSI48
#define MCCI_STM32L0_REG_RCC_CRRCR_RSV3		UINT32_C(0xF8)		//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48DIVEN	(UINT32_C(1) << 2)	//< deliver HSI48/6 to TIM3
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48RDY	(UINT32_C(1) << 1)	//< 48 MHz clock ready
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48ON	(UINT32_C(1) << 0)	//< 48 MHz clock enable
///	@}

/// \name RCC_CFGR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CFGR_RSV31		(UINT32_C(1) << 31)

#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE	(UINT32_C(7) << 28)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 3)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 4)

#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL	(UINT32_C(0xF) << 24)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_OFF	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_SYSCLK	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 3)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 4)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 5)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 6)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 7)
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSI48	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 8)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV	(UINT32_C(3) << 22)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_3	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 3)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL	(UINT32_C(0xF) << 18)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_3	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_6	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 3)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_12	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 4)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 5)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_24	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 6)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 7)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_48	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 8)
#define MCCI_STM32L0_REG_RCC_CFGR_RSV17		(UINT32_C(1) << 17)
#define MCCI_STM32L0_REG_RCC_CFGR_PLLSRC	(UINT32_C(1) << 16)
#define MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK	(UINT32_C(1) << 15)
#define MCCI_STM32L0_REG_RCC_CFGR_RSV14		(UINT32_C(1) << 14)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2		(UINT32_C(7) << 11)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 4)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 5)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 6)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 7)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1		(UINT32_C(7) << 8)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 4)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 5)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 6)
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 7)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE		(UINT32_C(0xF) << 4)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 8)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 9)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 10)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 11)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 12)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_64	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 13)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_128	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 14)
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_256	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 15)
#define MCCI_STM32L0_REG_RCC_CFGR_SWS		(UINT32_C(3) << 2)
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 3)
#define MCCI_STM32L0_REG_RCC_CFGR_SW		(UINT32_C(3) << 0)
#define MCCI_STM32L0_REG_RCC_CFGR_SW_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 0)
#define MCCI_STM32L0_REG_RCC_CFGR_SW_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 1)
#define MCCI_STM32L0_REG_RCC_CFGR_SW_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 2)
#define MCCI_STM32L0_REG_RCC_CFGR_SW_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 3)
///	@}

/// \name RCC_CIER bits
///	@{
#define MCCI_STM32L0_REG_RCC_CIER_RSV8		UINT32_C(0xFFFFFF00)
#define MCCI_STM32L0_REG_RCC_CIER_CSSLSE	(UINT32_C(1) << 7)
#define MCCI_STM32L0_REG_RCC_CIER_HSI48RDYIE	(UINT32_C(1) << 6)
#define MCCI_STM32L0_REG_RCC_CIER_MSIRDYIE	(UINT32_C(1) << 5)
#define MCCI_STM32L0_REG_RCC_CIER_PLLRDYIE	(UINT32_C(1) << 4)
#define MCCI_STM32L0_REG_RCC_CIER_HSERDYIE	(UINT32_C(1) << 3)
#define MCCI_STM32L0_REG_RCC_CIER_HSI16RDYIE	(UINT32_C(1) << 2)
#define MCCI_STM32L0_REG_RCC_CIER_LSERDYIE	(UINT32_C(1) << 1)
#define MCCI_STM32L0_REG_RCC_CIER_LSIRDYIE	(UINT32_C(1) << 0)
///	@}

