mcci-catena/bootloader/soc/stm32l0/i/mcci_bootloader_stm32l0xx.h
/// \name RCC_CIFR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CIFR_RSV9		UINT32_C(0xFFFFFE00)
#define MCCI_STM32L0_REG_RCC_CIFR_CSSHSEF	(UINT32_C(1) << 8)
#define MCCI_STM32L0_REG_RCC_CIFR_CSSLSEF	(UINT32_C(1) << 7)
#define MCCI_STM32L0_REG_RCC_CIFR_HSI48RDYF	(UINT32_C(1) << 6)
#define MCCI_STM32L0_REG_RCC_CIFR_MSIRDYF	(UINT32_C(1) << 5)
#define MCCI_STM32L0_REG_RCC_CIFR_PLLRDYF	(UINT32_C(1) << 4)
#define MCCI_STM32L0_REG_RCC_CIFR_HSERDYF	(UINT32_C(1) << 3)
#define MCCI_STM32L0_REG_RCC_CIFR_HSI16RDYF	(UINT32_C(1) << 2)
#define MCCI_STM32L0_REG_RCC_CIFR_LSERDYF	(UINT32_C(1) << 1)
#define MCCI_STM32L0_REG_RCC_CIFR_LSIRDYF	(UINT32_C(1) << 0)
///	@}

/// \name RCC_CICR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CICR_RSV9		UINT32_C(0xFFFFFE00)
#define MCCI_STM32L0_REG_RCC_CICR_CSSHSEC	(UINT32_C(1) << 8)
#define MCCI_STM32L0_REG_RCC_CICR_CSSLSEC	(UINT32_C(1) << 7)
#define MCCI_STM32L0_REG_RCC_CICR_HSI48RDYC	(UINT32_C(1) << 6)
#define MCCI_STM32L0_REG_RCC_CICR_MSIRDYC	(UINT32_C(1) << 5)
#define MCCI_STM32L0_REG_RCC_CICR_PLLRDYC	(UINT32_C(1) << 4)
#define MCCI_STM32L0_REG_RCC_CICR_HSERDYC	(UINT32_C(1) << 3)
#define MCCI_STM32L0_REG_RCC_CICR_HSI16RDYC	(UINT32_C(1) << 2)
#define MCCI_STM32L0_REG_RCC_CICR_LSERDYC	(UINT32_C(1) << 1)
#define MCCI_STM32L0_REG_RCC_CICR_LSIRDYC	(UINT32_C(1) << 0)
///	@}

/// \name RCC_IOPRSTR bits
///	@{
#define MCCI_STM32L0_REG_RCC_IOPRSTR_RSV8	UINT32_C(0xFFFFFF00)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPHRST	(UINT32_C(1) << 7)	//< Port H reset
#define MCCI_STM32L0_REG_RCC_IOPRSTR_RSV5	(UINT32_C(3) << 5)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPERST	(UINT32_C(1) << 4)	//< Port E reset
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPDRST	(UINT32_C(1) << 3)	//< Port D reset
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPCRST	(UINT32_C(1) << 2)	//< Port C reset
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPBRST	(UINT32_C(1) << 1)	//< Port B reset
#define MCCI_STM32L0_REG_RCC_IOPRSTR_IOPARST	(UINT32_C(1) << 0)	//< Port A reset
///	@}

/// \name RCC_AHBRSTR bits
///	@{
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_CRYPRST	(UINT32_C(1) << 24)	//< Crypto reset
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV21	(UINT32_C(7) << 21)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RNGRST	(UINT32_C(1) << 20)	//< Random number generator reset
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV17	(UINT32_C(7) << 17)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_TSCRST	(UINT32_C(1) << 16)	//< Touch sensor reset
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV13	(UINT32_C(7) << 13)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_CRCRST	(UINT32_C(1) << 12)	//< CRC reset
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV9	(UINT32_C(7) << 9)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_MIFRST	(UINT32_C(1) << 8)	//< Memory interface reset
#define MCCI_STM32L0_REG_RCC_AHBRSTR_RSV1	(UINT32_C(0x7F) << 1)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBRSTR_DMARST	(UINT32_C(1) << 0)	//< DMA reset
///	@}

/// \name RCC_APB2RSTR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV23	UINT32_C(0xFF800000)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_DBGRST	(UINT32_C(1) << 22)	///< Debug reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV15	(UINT32_C(0x7F) << 15)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_USART1RST	(UINT32_C(1) << 14)	///< USART1 reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV13	(UINT32_C(1) << 13)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_SPI1RST	(UINT32_C(1) << 12)	///< SPI1 reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV10	(UINT32_C(3) << 10)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_ADCRST	(UINT32_C(1) << 9)	///< ADC reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV6	(UINT32_C(7) << 6)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_TIM22RST	(UINT32_C(1) << 5)	///< TIM22 reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV3	(UINT32_C(3) << 3)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_TIM21RST	(UINT32_C(1) << 2)	///< TIM21 reset
#define MCCI_STM32L0_REG_RCC_APB2RSTR_RSV1	(UINT32_C(1) << 1)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2RSTR_SYSCFRST	(UINT32_C(1) << 0)	///< SYSCFG reset
///	@}

/// \name RCC_APB1RSTR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB1RSTR_LPTIM1RST		(UINT32_C(1) << 31)	//< LPTIM1 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_I2C3RST		(UINT32_C(1) << 30)	//< I2C3 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_DACRRST		(UINT32_C(1) << 29)	//< DACR reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_PWRRST		(UINT32_C(1) << 28)	//< PWR reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_CRSRST		(UINT32_C(1) << 27)	//< CRS reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_RSV24		(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1RSTR_USBRST		(UINT32_C(1) << 23)	//< USB reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_I2C2RST		(UINT32_C(1) << 22)	//< I2C2 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_I2C1RST		(UINT32_C(1) << 21)	//< I2C1 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_USART5RST		(UINT32_C(1) << 20)	//< USART5 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_USART4RST		(UINT32_C(1) << 19)	//< USART4 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_LPUART1RST	(UINT32_C(1) << 18)	//< LPUART1 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_USART2RST		(UINT32_C(1) << 17)	//< USART2 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_RSV15		(UINT32_C(3) << 15)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1RSTR_SPI2RST		(UINT32_C(1) << 14)	//< SPI2 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_RSV12		(UINT32_C(3) << 12)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1RSTR_WWDGRST		(UINT32_C(1) << 11)	//< Watchdog reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_RSV6		(UINT32_C(0x1F) << 6)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1RSTR_TIM7RST		(UINT32_C(1) << 5)	//< TIM7 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_TIM6RST		(UINT32_C(1) << 4)	//< TIM6 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_RSV2		(UINT32_C(3) << 2)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1RSTR_TIM3		(UINT32_C(1) << 1)	//< TIM3 reset
#define MCCI_STM32L0_REG_RCC_APB1RSTR_TIM2		(UINT32_C(1) << 0)	//< TIM2 reset
///	@}

