mcci-catena/bootloader/soc/stm32l0/i/mcci_bootloader_stm32l0xx.h
/// \name RCC_IOPENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_IOPENR_RSV8	UINT32_C(0xFFFFFF00)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPHEN	(UINT32_C(1) << 7)	//< Port H enable
#define MCCI_STM32L0_REG_RCC_IOPENR_RSV5	(UINT32_C(3) << 5)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPEEN	(UINT32_C(1) << 4)	//< Port E enable
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPDEN	(UINT32_C(1) << 3)	//< Port D enable
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPCEN	(UINT32_C(1) << 2)	//< Port C enable
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPBEN	(UINT32_C(1) << 1)	//< Port B enable
#define MCCI_STM32L0_REG_RCC_IOPENR_IOPAEN	(UINT32_C(1) << 0)	//< Port A enable
///	@}

/// \name RCC_AHBENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_CRYPEN	(UINT32_C(1) << 24)	//< Crypto enable
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV21	(UINT32_C(7) << 21)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_RNGEN	(UINT32_C(1) << 20)	//< Random number generator enable
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV17	(UINT32_C(7) << 17)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_TSCEN	(UINT32_C(1) << 16)	//< Touch sensor enable
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV13	(UINT32_C(7) << 13)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_CRCEN	(UINT32_C(1) << 12)	//< CRC enable
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV9	(UINT32_C(7) << 9)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_MIFEN	(UINT32_C(1) << 8)	//< Memory interface enable
#define MCCI_STM32L0_REG_RCC_AHBENR_RSV1	(UINT32_C(0x7F) << 1)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBENR_DMAEN	(UINT32_C(1) << 0)	//< DMA enable
///	@}

/// \name RCC_APB2ENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV23	UINT32_C(0xFF800000)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_DBGEN	(UINT32_C(1) << 22)	///< Debug enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV15	(UINT32_C(0x7F) << 15)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_USART1EN	(UINT32_C(1) << 14)	///< USART1 enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV13	(UINT32_C(1) << 13)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_SPI1EN	(UINT32_C(1) << 12)	///< SPI1 enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV10	(UINT32_C(3) << 10)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_ADCEN	(UINT32_C(1) << 9)	///< ADC enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV6	(UINT32_C(7) << 6)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_TIM22EN	(UINT32_C(1) << 5)	///< TIM22 enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV3	(UINT32_C(3) << 3)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_TIM21EN	(UINT32_C(1) << 2)	///< TIM21 enable
#define MCCI_STM32L0_REG_RCC_APB2ENR_RSV1	(UINT32_C(1) << 1)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2ENR_SYSCFEN	(UINT32_C(1) << 0)	///< SYSCFG enable
///	@}

/// \name RCC_APB1ENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB1ENR_LPTIM1EN		(UINT32_C(1) << 31)	//< LPTIM1 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_I2C3EN		(UINT32_C(1) << 30)	//< I2C3 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_DACREN		(UINT32_C(1) << 29)	//< DACR enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_PWREN		(UINT32_C(1) << 28)	//< PWR enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_CRSEN		(UINT32_C(1) << 27)	//< CRS enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_RSV24		(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1ENR_USBEN		(UINT32_C(1) << 23)	//< USB enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_I2C2EN		(UINT32_C(1) << 22)	//< I2C2 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_I2C1EN		(UINT32_C(1) << 21)	//< I2C1 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_USART5EN		(UINT32_C(1) << 20)	//< USART5 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_USART4EN		(UINT32_C(1) << 19)	//< USART4 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_LPUART1EN		(UINT32_C(1) << 18)	//< LPUART1 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_USART2EN		(UINT32_C(1) << 17)	//< USART2 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_RSV15		(UINT32_C(3) << 15)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1ENR_SPI2EN		(UINT32_C(1) << 14)	//< SPI2 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_RSV12		(UINT32_C(3) << 12)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1ENR_WWDGEN		(UINT32_C(1) << 11)	//< Watchdog enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_RSV6		(UINT32_C(0x1F) << 6)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1ENR_TIM7EN		(UINT32_C(1) << 5)	//< TIM7 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_TIM6EN		(UINT32_C(1) << 4)	//< TIM6 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_RSV2		(UINT32_C(3) << 2)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1ENR_TIM3		(UINT32_C(1) << 1)	//< TIM3 enable
#define MCCI_STM32L0_REG_RCC_APB1ENR_TIM2		(UINT32_C(1) << 0)	//< TIM2 enable
///	@}

/// \name RCC_IOPSMEN bits
///	@{
#define MCCI_STM32L0_REG_RCC_IOPSMENR_RSV8	UINT32_C(0xFFFFFF00)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPHSMEN	(UINT32_C(1) << 7)	//< Port H sleep-mode enable
#define MCCI_STM32L0_REG_RCC_IOPSMENR_RSV5	(UINT32_C(3) << 5)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPESMEN	(UINT32_C(1) << 4)	//< Port E sleep-mode enable
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPDSMEN	(UINT32_C(1) << 3)	//< Port D sleep-mode enable
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPCSMEN	(UINT32_C(1) << 2)	//< Port C sleep-mode enable
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPBSMEN	(UINT32_C(1) << 1)	//< Port B sleep-mode enable
#define MCCI_STM32L0_REG_RCC_IOPSMENR_IOPASMEN	(UINT32_C(1) << 0)	//< Port A sleep-mode enable
///	@}

/// \name RCC_AHBSMENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV25	(UINT32_C(0x7F) << 25)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_CRYPSMEN	(UINT32_C(1) << 24)	//< Crypto sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV21	(UINT32_C(7) << 21)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RNGSMEN	(UINT32_C(1) << 20)	//< Random number generator sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV17	(UINT32_C(7) << 17)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_TSCSMEN	(UINT32_C(1) << 16)	//< Touch sensor sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV13	(UINT32_C(7) << 13)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_CRCSMEN	(UINT32_C(1) << 12)	//< CRC sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV10	(UINT32_C(3) << 10)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_SRAMSMEN	(UINT32_C(1) << 9)	//< SRAM sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_MIFSMEN	(UINT32_C(1) << 8)	//< Memory interface sleep-mode enable
#define MCCI_STM32L0_REG_RCC_AHBSMENR_RSV1	(UINT32_C(0x7F) << 1)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_AHBSMENR_DMASMEN	(UINT32_C(1) << 0)	//< DMA sleep-mode enable
///	@}

/// \name RCC_APB2SMENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV23		UINT32_C(0xFF800000)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_DBGSMEN		(UINT32_C(1) << 22)	///< Debug sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV15		(UINT32_C(0x7F) << 15)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_USART1SMEN	(UINT32_C(1) << 14)	///< USART1 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV13		(UINT32_C(1) << 13)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_SPI1SMEN		(UINT32_C(1) << 12)	///< SPI1 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV10		(UINT32_C(3) << 10)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_ADCSMEN		(UINT32_C(1) << 9)	///< ADC sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV6		(UINT32_C(7) << 6)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_TIM22SMEN	(UINT32_C(1) << 5)	///< TIM22 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV3		(UINT32_C(3) << 3)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_TIM21SMEN	(UINT32_C(1) << 2)	///< TIM21 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB2SMENR_RSV1		(UINT32_C(1) << 1)	///< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB2SMENR_SYSCFSMEN	(UINT32_C(1) << 0)	///< SYSCFG sleep-mode enable
///	@}

/// \name RCC_APB1SMENR bits
///	@{
#define MCCI_STM32L0_REG_RCC_APB1SMENR_LPTIM1SMEN	(UINT32_C(1) << 31)	//< LPTIM1 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_I2C3SMEN		(UINT32_C(1) << 30)	//< I2C3 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_DACRSMEN		(UINT32_C(1) << 29)	//< DACR sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_PWRSMEN		(UINT32_C(1) << 28)	//< PWR sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_CRSSMEN		(UINT32_C(1) << 27)	//< CRS sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_RSV24		(UINT32_C(7) << 24)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1SMENR_USBSMEN		(UINT32_C(1) << 23)	//< USB sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_I2C2SMEN		(UINT32_C(1) << 22)	//< I2C2 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_I2C1SMEN		(UINT32_C(1) << 21)	//< I2C1 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_USART5SMEN	(UINT32_C(1) << 20)	//< USART5 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_USART4SMEN	(UINT32_C(1) << 19)	//< USART4 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_LPUART1SMEN	(UINT32_C(1) << 18)	//< LPUART1 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_USART2SMEN	(UINT32_C(1) << 17)	//< USART2 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_RSV15		(UINT32_C(3) << 15)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1SMENR_SPI2SMEN		(UINT32_C(1) << 14)	//< SPI2 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_RSV12		(UINT32_C(3) << 12)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1SMENR_WWDGSMEN		(UINT32_C(1) << 11)	//< Watchdog sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_RSV6		(UINT32_C(0x1F) << 6)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1SMENR_TIM7SMEN		(UINT32_C(1) << 5)	//< TIM7 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_TIM6SMEN		(UINT32_C(1) << 4)	//< TIM6 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_RSV2		(UINT32_C(3) << 2)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_APB1SMENR_TIM3		(UINT32_C(1) << 1)	//< TIM3 sleep-mode enable
#define MCCI_STM32L0_REG_RCC_APB1SMENR_TIM2		(UINT32_C(1) << 0)	//< TIM2 sleep-mode enable
///	@}

