mcci-catena/bootloader/soc/stm32l0/i/mcci_bootloader_stm32l0xx.h
/// \name RCC_CCIPR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CCIPR_RSV27	(UINT32_C(0x1F) << 27)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CCIPR_HSI48SEL	(UINT32_C(1) << 26)	//< HSI48 from PLL USB (not RC48)
#define MCCI_STM32L0_REG_RCC_CCIPR_RSV20	(UINT32_C(0x3F) << 20)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL	(UINT32_C(3) << 18)	//< select LPTIM1 srt
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL	(UINT32_C(3) << 16)	//< 
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_APB		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_LSI		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 2)	//< HSI16 clock

#define MCCI_STM32L0_REG_RCC_CCIPR_RSV14	(UINT32_C(3) << 14)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL	(UINT32_C(3) << 12)	//< 
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_APB		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_LSI		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 2)	//< HSI16 clock

#define MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL	(UINT32_C(3) << 10)	//< 
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_RSV4		(UINT32_C(0x3F) << 4)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL	(UINT32_C(3) << 2)	//< 
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL	(UINT32_C(3) << 0)	//< 
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 3)	//< LSE clock
///	@}

/// \name RCC_CSR bits
///	@{
#define  MCCI_STM32L0_REG_RCC_CSR_LPWRRSTF	(UINT32_C(1) << 31)	//< Reset due to low-power
#define  MCCI_STM32L0_REG_RCC_CSR_WWDGRSTF	(UINT32_C(1) << 30)	//< reset due to window watchdog
#define  MCCI_STM32L0_REG_RCC_CSR_IWDGRSTF	(UINT32_C(1) << 29)	//< reset due to independent watchdog
#define  MCCI_STM32L0_REG_RCC_CSR_SFTRSTF	(UINT32_C(1) << 28)	//< reset due to softwaare
#define  MCCI_STM32L0_REG_RCC_CSR_PORRSTF	(UINT32_C(1) << 27)	//< reset due to power: POR, PDR
#define  MCCI_STM32L0_REG_RCC_CSR_PINRSTF	(UINT32_C(1) << 26)	//< reset due to NRST pin
#define  MCCI_STM32L0_REG_RCC_CSR_OBLRSTF	(UINT32_C(1) << 25)	//< reset due to option byte loading
#define  MCCI_STM32L0_REG_RCC_CSR_FWRSTF	(UINT32_C(1) << 24)	//< reset due to firewall
#define  MCCI_STM32L0_REG_RCC_CSR_RMVF		(UINT32_C(1) << 23)	//< remove reset (clears flags)
#define  MCCI_STM32L0_REG_RCC_CSR_RSV20		(UINT32_C(7) << 20)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_RTCRST	(UINT32_C(1) << 19)	//< reset RTC and backup
#define  MCCI_STM32L0_REG_RCC_CSR_RTCEN		(UINT32_C(1) << 18)	//< enable RTC

#define  MCCI_STM32L0_REG_RCC_CSR_RTCSEL	(UINT32_C(3) << 16)	//< RTC clock source select
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_NONE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< no RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< LSE clock as RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< LSI clock as RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< HSE clock divided as RTC clock

#define  MCCI_STM32L0_REG_RCC_CSR_RSV15		(UINT32_C(1) << 15)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_CSSLSED	(UINT32_C(1) << 14)	//< CSS on LSE failure
#define  MCCI_STM32L0_REG_RCC_CSR_CSSLSEON	(UINT32_C(1) << 13)	//< CSS on LSE enable

#define  MCCI_STM32L0_REG_RCC_CSR_LSEDRV	(UINT32_C(3) << 11)	//< LSE drive
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_LOW	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 0)	//< LSE drive: lowest
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_M1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 1)	//< LSE drive: medium low
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_M2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 2)	//< LSE drive: medium high
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_HIGH	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 3)	//< LSE drive: highest

#define  MCCI_STM32L0_REG_RCC_CSR_LSEBYP	(UINT32_C(1) << 10)	//< external LSE bypass
#define  MCCI_STM32L0_REG_RCC_CSR_LSERDY	(UINT32_C(1) << 9)	//< LSE ready
#define  MCCI_STM32L0_REG_RCC_CSR_LSEON		(UINT32_C(1) << 8)	//< LSE enable
#define  MCCI_STM32L0_REG_RCC_CSR_RSV2		(UINT32_C(0x3F) << 2)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_LSIRDY	(UINT32_C(1) << 1)	//< LSI ready
#define  MCCI_STM32L0_REG_RCC_CSR_LSION		(UINT32_C(1) << 0)	//< LSI enable
///	@}


/****************************************************************************\
|
|	SPI Control Registers
|
\****************************************************************************/

/// \name SPI offsets
///	@{
#define	MCCI_STM32L0_SPI_CR1		UINT32_C(0x00)	///< offset to SPI control register 1
#define MCCI_STM32L0_SPI_CR2		UINT32_C(0x04)	///< offset to SPI control register 2
#define MCCI_STM32L0_SPI_SR		UINT32_C(0x08)	///< offset to SPI status register
#define MCCI_STM32L0_SPI_DR		UINT32_C(0x0C)	///< offset to SPI data register
#define MCCI_STM32L0_SPI_CRCPR		UINT32_C(0x10)	///< offset to SPI CRC polynomial
#define MCCI_STM32L0_SPI_RXCRCR		UINT32_C(0x14)	///< offset to SPI receive CRC
#define MCCI_STM32L0_SPI_TXCRCR		UINT32_C(0x18)	///< offset to SPI transmit CRC
#define MCCI_STM32L0_SPI_I2SCFGR	UINT32_C(0x1C)	///< offset to SPI I2S config register
#define MCCI_STM32L0_SPI_I2SPR		UINT32_C(0x20)	///< offset to SPI I2S prescaler

/// \name SPI_CR1 bits
///	@{
#define MCCI_STM32L0_SPI_CR1_RSV16	UINT32_C(0xFFFF0000)	///< reserved
#define MCCI_STM32L0_SPI_CR1_BIDIMODE	(UINT32_C(1) << 15)	///< Bidirectional mode
#define MCCI_STM32L0_SPI_CR1_BIDIOE	(UINT32_C(1) << 14)	///< Bidirectional output enable
#define MCCI_STM32L0_SPI_CR1_CRCEN	(UINT32_C(1) << 13)	///< CRC enabled
#define MCCI_STM32L0_SPI_CR1_CRCNEXT	(UINT32_C(1) << 12)	///< CRC is next
#define MCCI_STM32L0_SPI_CR1_DFF	(UINT32_C(1) << 11)	///< Data frame format (16 bit / not 8 bit)
#define MCCI_STM32L0_SPI_CR1_RXONLY	(UINT32_C(1) << 10)	///< Receive-only mode
#define MCCI_STM32L0_SPI_CR1_SSM	(UINT32_C(1) << 9)	///< software slave management
#define MCCI_STM32L0_SPI_CR1_SSI	(UINT32_C(1) << 8)	///< internal slave select
#define MCCI_STM32L0_SPI_CR1_LSBFIRST	(UINT32_C(1) << 7)	///< LSB first (not MSB)
#define MCCI_STM32L0_SPI_CR1_SPE	(UINT32_C(1) << 6)	///< SPI enabled

#define MCCI_STM32L0_SPI_CR1_BR		(UINT32_C(7) << 3)	///< baud rate control (PCLK divisor)
# define MCCI_STM32L0_SPI_CR1_BR_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 0)	///< PCLK/2
# define MCCI_STM32L0_SPI_CR1_BR_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 1)	///< PCLK/4
# define MCCI_STM32L0_SPI_CR1_BR_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 2)	///< PCLK/8
# define MCCI_STM32L0_SPI_CR1_BR_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 3)	///< PCLK/16
# define MCCI_STM32L0_SPI_CR1_BR_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 4)	///< PCLK/32
# define MCCI_STM32L0_SPI_CR1_BR_64	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 5)	///< PCLK/64
# define MCCI_STM32L0_SPI_CR1_BR_128	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 6)	///< PCLK/128
# define MCCI_STM32L0_SPI_CR1_BR_256	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 7)	///< PCLK/256

#define MCCI_STM32L0_SPI_CR1_MSTR	(UINT32_C(1) << 2)	///< Master (not slave) 
#define MCCI_STM32L0_SPI_CR1_CPOL	(UINT32_C(1) << 1)	///< Clk to 1 when idle (not zero)
#define MCCI_STM32L0_SPI_CR1_CPHA	(UINT32_C(1) << 0)	///< Clock phase: second clock transaction captures (not first)
///	@}

/// \name SPI_CR2 bits
///	@{
#define MCCI_STM32L0_SPI_CR2_RSV8	UINT32_C(0xFFFFFF00)	///< reserved
#define MCCI_STM32L0_SPI_CR2_TXEIE	(UINT32_C(1) << 7)	///< tx empty interrupt enable
#define MCCI_STM32L0_SPI_CR2_RXNEIE	(UINT32_C(1) << 6)	///< rx not empty interrupt enable
#define MCCI_STM32L0_SPI_CR2_ERRIE	(UINT32_C(1) << 5)	///< error interrupt enable
#define MCCI_STM32L0_SPI_CR2_FRF	(UINT32_C(1) << 4)	///< frame format TI (not Motorola)
#define MCCI_STM32L0_SPI_CR2_RSV3	(UINT32_C(1) << 3)	///< reserved, zero
#define MCCI_STM32L0_SPI_CR2_SSOE	(UINT32_C(1) << 2)	///< enable SS in master mode
#define MCCI_STM32L0_SPI_CR2_TXDMAEN	(UINT32_C(1) << 1)	///< tx DMA enable
#define MCCI_STM32L0_SPI_CR2_RXDMAEN	(UINT32_C(1) << 0)	///< rx DMA enable
///	@}

/// \name SPI_SR bits
///	@{
#define MCCI_STM32L0_SPI_SR_RSV9	UINT32_C(0xFFFFFE00)	///< reserved, zero
#define MCCI_STM32L0_SPI_SR_FRE		(UINT32_C(1) << 8)	///< frame error (read to clear)
#define MCCI_STM32L0_SPI_SR_BSY		(UINT32_C(1) << 7)	///< busy
#define MCCI_STM32L0_SPI_SR_OVR		(UINT32_C(1) << 6)	///< overrun
#define MCCI_STM32L0_SPI_SR_MODF	(UINT32_C(1) << 5)	///< mode fault
#define MCCI_STM32L0_SPI_SR_CRCERR	(UINT32_C(1) << 4)	///< CRC error (write zero to clear)
#define MCCI_STM32L0_SPI_SR_UDR		(UINT32_C(1) << 3)	///< underrun
#define MCCI_STM32L0_SPI_SR_CHSIDE	(UINT32_C(1) << 2)	///< channel right (not left)
#define MCCI_STM32L0_SPI_SR_TXE		(UINT32_C(1) << 1)	///< TX buffer empty
#define MCCI_STM32L0_SPI_SR_RXE		(UINT32_C(1) << 0)	///< RX buffer not-empty
///	@}

/// \name SPI_I2SCFGR bits
///	@{
#define MCCI_STM32L0_SPI_I2SCFGR_RSV13		UINT32_C(0xFFFFE000)	///< reserved (do not change)
#define MCCI_STM32L0_SPI_I2SCFGR_I2SMOD		(UINT32_C(1) << 11)	///< I2S mode (not SPI)
#define MCCI_STM32L0_SPI_I2SCFGR_I2SE		(UINT32_C(1) << 10)	///< I2S enable
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG		(UINT32_C(3) << 8)	///< I2S configuration mode
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_STX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 0)	///< I2S slave transmit
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_SRX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 1)	///< I2S slave receive
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_MRX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 2)	///< I2S master transmit
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_MRX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 3)	///< I2S master receive
#define MCCI_STM32L0_SPI_I2SCFGR_PCMSYNC	(UINT32_C(1) << 7)	///< Long (not short) PCM frame synchronization
#define MCCI_STM32L0_SPI_I2SCFGR_RSV6		(UINT32_C(1) << 6)	///< reserved, zero
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD		(UINT32_C(3) << 4)	///< I2S standard selection
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_PHILIPS	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 0)	///< Philips standard.
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_LEFT	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 1)	///< MSB justified
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_RIGHT	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 2)	///< LSB justified
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_PCM	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 3)	///< PCM standard
#define MCCI_STM32L0_SPI_I2SCFGR_CKPOL		(UINT32_C(1) << 3)	///< steady state clock polarity high (not low)
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN		(UINT32_C(3) << 1)	///< data length
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 0)	///< 16-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_24	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 1)	///< 24-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 2)	///< 32-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_XX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 3)	///< invalid data length
#define MCCI_STM32L0_SPI_I2SCFGR_CHLEN		(UINT32_C(1) << 0)	///< channel 32-bits wide (not 16)
///	@}


#ifdef __cplusplus
}
#endif

#endif /* _mcci_bootloader_stm32l0xx_h_ */
